app/Models/MKendaraan.php

    public function getKendaraan($id = false){
        if ($id === false){
            return $this->table('kendaraan')->orderBy('idKendaraan', 'DESC')->get();
---
SELECT *
FROM `kendaraan`
ORDER BY `idKendaraan` DESC

    public function newKendaraan($data){
        $query = $this->db->table('kendaraan')->insert($data);
---
INSERT INTO `kendaraan` (`namaKendaraan`) VALUES ('Bus')

    public function updateKendaraan($data, $id){
        $query = $this->db->table('kendaraan')->update($data, array('idKendaraan' => $id));
---
UPDATE `kendaraan` SET `namaKendaraan` = 'BUS'
WHERE `idKendaraan` = '3'

    public function deleteKendaraan($id){
        $query = $this->db->table('kendaraan')->delete(array('idKendaraan' => $id));
---
DELETE FROM `kendaraan`
WHERE `idKendaraan` = '4'