app/Models/MParkir.php

    public function getParkir($id = false){
        if ($id === false){
            $builder = $this->table('parkir')->select('*');
            $builder->join('kendaraan', 'idKendaraan = typeKendaraan', 'left');
            return $builder->get();
---
SELECT *
FROM `kendaraan`
SELECT *
FROM `parkir`
LEFT JOIN `kendaraan` ON `idKendaraan` = `typeKendaraan`

    public function newParkir($data){
        $query = $this->db->table('parkir')->insert($data);
---
INSERT INTO `parkir` (`typeKendaraan`, `platKendaraan`) VALUES ('1', 'BP1122PQ')

    public function updateParkir($data, $id){
        $query = $this->db->table('parkir')->update($data, array('idParkir' => $id));
---
UPDATE `parkir` SET `typeKendaraan` = '4', `platKendaraan` = 'BP2221'
WHERE `idParkir` = 'BP2221'